# Personal Finance Analysis ðŸ“Š

## Introduction
- In this project we will be taking a look at my personal finances.
- These are directly taken from the Hawaii State federal Credit Union web portal 
- This is time series Data as they are taking every month from 2016-2023
- we will be doing some analysis on the data, both checking and savings.

## Call in the data sets and the libraries

In [3]:
# start with the generic 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## call in the data set

In [4]:
df_checking = pd.read_csv('../data/Checking_Transactions.csv')
df_checking.head()

,Transaction ID,Date,Description,Check Number,Category,Amount,Balance
0,98347589|9178,08/24/23,Point Of Sale Withdrawal KRISPY KREME #1123 ...,NaN,Restaurants/Dining,-$23.39,$180.15
1,98347589|9177,08/22/23,Point Of Sale Withdrawal RODEO GENERAL STORE ...,NaN,Groceries,-$4.06,$203.54
2,98347589|9176,08/21/23,Point Of Sale Withdrawal RODEO GENERAL STORE ...,NaN,Groceries,-$2.66,$207.60
3,98347589|9175,08/21/23,Point Of Sale Withdrawal RODEO GENERAL STORE ...,NaN,Groceries,-$7.71,$210.26
4,98347589|9174,08/21/23,Point Of Sale Withdrawal COURSRA5PNTH7L5RV2EQN...,NaN,Clothing/Shoes,-$49.00,$217.97

In [5]:
df_savings = pd.read_csv('../data/Savings_transactions.csv')
df_savings.head()

,Transaction ID,Date,Description,Check Number,Category,Amount,Balance
0,98347570|2914,08/24/23,External Withdrawal PAYPAL 230823PPZ6KO - INST...,NaN,Transfers,-$9.99,"$1,958.17"
1,98347570|2913,08/21/23,External Deposit PAYPAL TRANSFER - TRANSFER,NaN,Transfers,$59.26,"$1,968.16"
2,98347570|2912,08/16/23,Withdrawal Transfer To *7589; REF:,NaN,Transfers,-$235.00,"$1,908.90"
3,98347570|2911,08/07/23,Withdrawal Transfer To *7589; REF:,NaN,Transfers,-$60.00,"$2,143.90"
4,98347570|2910,08/07/23,Deposit Transfer From *6495; REF:,NaN,Transfers,"$1,476.00","$2,203.90"

## Checking account

#### Plan for the data set
1. Fix the Transaction ID so it only has the number after the '/'
2. Change the [Date] to "Date time" stuff. 
3. Turn the [Date] in to the Index. 
4. Add "Is_Check" coloumn based on the [Check Number] coloumn. 
5. Replace all the [Check Number] "NaN" values with "N/A"
6. take away the "$" from the [Amount] and [Balance] coloumns

### 1. Transaction

In [8]:
# Get the last 4 digits 
df_checking['Transaction ID'] = df_checking['Transaction ID'].str.split('|').str[-1]
df_checking["Transaction ID"]

0       9178
1       9177
2       9176
3       9175
4       9174
        ...
1471    7706
1472    7705
1473    7703
1474    7702
1475    7700
Name: Transaction ID, Length: 1476, dtype: object

In [9]:
df_checking.head(1)

,Transaction ID,Date,Description,Check Number,Category,Amount,Balance
0,9178,08/24/23,Point Of Sale Withdrawal KRISPY KREME #1123 ...,NaN,Restaurants/Dining,-$23.39,$180.15

### 2. Date

In [11]:
# Make the Data Column a Data Time data time. 
df_checking['Date'] = pd.to_datetime(df_checking['Date'], format='%m/%d/%y')

In [12]:
df_checking.head(1)

,Transaction ID,Date,Description,Check Number,Category,Amount,Balance
0,9178,2023-08-24,Point Of Sale Withdrawal KRISPY KREME #1123 ...,NaN,Restaurants/Dining,-$23.39,$180.15

In [13]:
# Set the Index to the Date Column
df_checking.set_index('Date', inplace=True)

In [14]:
df_checking.head(1)

,Transaction ID,Description,Check Number,Category,Amount,Balance
Date,,,,,,
2023-08-24,9178,Point Of Sale Withdrawal KRISPY KREME #1123 ...,NaN,Restaurants/Dining,-$23.39,$180.15

### 3. Is_Check column & Check Number

In [15]:
# Replace the NaN Values
df_checking['Check Number'].fillna("Not Check", inplace=True)

In [17]:
df_checking["is_check"] = np.where(df_checking['Check Number'].isin(['Not Check']), 0, 1)

In [18]:
df_checking.head(1)

,Transaction ID,Description,Check Number,Category,Amount,Balance,is_check
Date,,,,,,,
2023-08-24,9178,Point Of Sale Withdrawal KRISPY KREME #1123 ...,Not Check,Restaurants/Dining,-$23.39,$180.15,0